import typing as tp

# Кодировка нижнего регистра букв
regular_letters_codes: tp.Dict[int, str] = {
    16: u"q",
    17: u"w",
    18: u"e",
    19: u"r",
    20: u"t",
    21: u"y",
    22: u"u",
    23: u"i",
    24: u"o",
    25: u"p",
    30: u"a",
    31: u"s",
    32: u"d",
    33: u"f",
    34: u"g",
    35: u"h",
    36: u"j",
    37: u"k",
    38: u"l",
    44: u"z",
    45: u"x",
    46: u"c",
    47: u"v",
    48: u"b",
    49: u"n",
    50: u"m",
}

# Кодировка нижнего регистра символов
regular_symbols_codes: tp.Dict[int, str] = {
    2: u"1",
    3: u"2",
    4: u"3",
    5: u"4",
    6: u"5",
    7: u"6",
    8: u"7",
    9: u"8",
    10: u"9",
    11: u"0",
    12: u"-",
    13: u"=",
    26: u"[",
    27: u"]",
    39: u";",
    40: u"'",
    41: u"`",
    43: u"\\",
    51: u",",
    52: u".",
    53: u"/",
    57: u" ",
}

# Кодировка верхнего регистра букв
capital_letters_codes: tp.Dict[int, str] = {
    16: u"Q",
    17: u"W",
    18: u"E",
    19: u"R",
    20: u"T",
    21: u"Y",
    22: u"U",
    23: u"I",
    24: u"O",
    25: u"P",
    30: u"A",
    31: u"S",
    32: u"D",
    33: u"F",
    34: u"G",
    35: u"H",
    36: u"J",
    37: u"K",
    38: u"L",
    44: u"Z",
    45: u"X",
    46: u"C",
    47: u"V",
    48: u"B",
    49: u"N",
    50: u"M",
}

# Кодировка верхнего регистра символов
capital_symbols_codes: tp.Dict[int, str] = {
    2: u"!",
    3: u"@",
    4: u"#",
    5: u"$",
    6: u"%",
    7: u"^",
    8: u"&",
    9: u"*",
    10: u"(",
    11: u")",
    12: u"_",
    13: u"+",
    26: u"{",
    27: u"}",
    39: u":",
    40: u'"',
    41: u"~",
    43: u"|",
    51: u"<",
    52: u">",
    53: u"?",
    57: u" ",
}

# Кодировка Numpad
numpad_symbols_codes: tp.Dict[int, str] = {
    79: u"1",
    80: u"2",
    81: u"3",
    75: u"4",
    76: u"5",
    77: u"6",
    71: u"7",
    72: u"8",
    73: u"9",
    82: u"0",
    98: u"/",
    55: u"*",
    74: u"-",
    78: u"+",
    83: u".",
}

# Клавиши - Триггеры отправки сообщения. При нажатии на эту клавишу отправляется текущая версия сообщения,
# после чего строка обнуляется, и устройство снова ожидает ввод данных.
send_trigger_keys: tp.Set[str] = {"KEY_ENTER", "KEY_KPENTER"}

# Клавиши для временной смены (при нажатии изменить, при отпускании
# вернуть) капитализации символов клавиатуры. Обычно Shift.
capitalize_all_keys: tp.Set[str] = {"KEY_LEFTSHIFT", "KEY_RIGHTSHIFT"}

# Клавиши для фиксированной смены капитализации символов клавиатуры. Обычно CapsLock.
capitalize_symbols_turn_keys: tp.Set[str] = {
    "KEY_CAPSLOCK",
}
